import csv
import os
from random import randint as rdm

# 示例数据
# pos_dict = {
#     '第一医院': {'口罩': 20000, '药品': 10000, '食物': 500, '人流量': rdm(5000, 10000), '高度': 50, '危险系数': 0.1},
#     '第二医院': {'口罩': 20000, '药品': 15000, '食物': 500, '人流量': rdm(10000, 20000), '高度': 50, '危险系数': 0.1},
#     '第一小学': {'口罩': 1000, '药品': 100, '食物': 1000, '人流量': rdm(3000, 5000), '高度': 15, '危险系数': 0.05},
#     '第一中学': {'口罩': 3000, '药品': 100, '食物': 2000, '人流量': rdm(10000, 20000), '高度': 20, '危险系数': 0.05},
#     '启翔湖': {'口罩': -200, '药品': -100, '食物': -50, '人流量': rdm(0, 50), '高度': 0, '危险系数': 0.2},
#     '碧桂园一期': {'口罩': 30000, '药品': 2000, '食物': 10000, '人流量': rdm(10000, 20000), '高度': 75, '危险系数': 0.1},
#     '碧桂园二期': {'口罩': 40000, '药品': 3000, '食物': 18000, '人流量': rdm(10000, 20000), '高度': 75, '危险系数': 0.1},
#     '碧桂园三期': {'口罩': 30000, '药品': 1000, '食物': 12000, '人流量': rdm(10000, 20000), '高度': 75, '危险系数': 0.1},
#     '万达': {'口罩': 2000, '药品': 100, '食物': 1000, '人流量': rdm(20000, 30000), '高度': 20, '危险系数': 0.1},
#     '写字楼': {'口罩': 5000, '药品': 100, '食物': 500, '人流量': rdm(1000, 5000), '高度': rdm(200, 350), '危险系数': 0.2},
#     '消防站': {'口罩': 4000, '药品': 500, '食物': 1200, '人流量': rdm(500, 1000), '高度': 50, '危险系数': 0.05},
#     '警察局': {'口罩': 4000, '药品': 600, '食物': 1500, '人流量': rdm(500, 1000), '高度': 10, '危险系数': 0.05},
#     '火葬场': {'口罩': 1000, '药品': 200, '食物': 1800, '人流量': rdm(500, 1000), '高度': 10, '危险系数': 0.05},
#     '大雁塔': {'口罩': -100, '药品': -50, '食物': -20, '人流量': rdm(40000, 50000), '高度': 65, '危险系数': 0.2}
# }
pos_dict = {
    '西安市曲江第一学校': {'口罩': 1000, '药品': 100, '食物': 1000, '人流量': rdm(3000, 5000), '高度': 15, '危险系数': 0.05},
    '陕西师范大学': {'口罩': 3000, '药品': 100, '食物': 2000, '人流量': rdm(10000, 20000), '高度': 20, '危险系数': 0.05},
    '西安职业技术学院': {'口罩': 3000, '药品': 100, '食物': 2000, '人流量': rdm(10000, 20000), '高度': 20, '危险系数': 0.05},
    '西安交通大学（曲江校区）': {'口罩': 3000, '药品': 100, '食物': 2000, '人流量': rdm(10000, 20000), '高度': 20, '危险系数': 0.05},
    '曲江立交交汇点': {'口罩': -200, '药品': -100, '食物': -50, '人流量': rdm(500, 2000), '高度': 0, '危险系数': 0.2},
    '西高新立交': {'口罩': -200, '药品': -100, '食物': -50, '人流量': rdm(500, 2000), '高度': 0, '危险系数': 0.2},
    '陕西大会堂': {'口罩': -200, '药品': -100, '食物': -50, '人流量': rdm(500, 2000), '高度': 0, '危险系数': 0.2},
    '甘家寨': {'口罩': 30000, '药品': 2000, '食物': 10000, '人流量': rdm(1000, 5000), '高度': 75, '危险系数': 0.1},
    '紫薇永和坊': {'口罩': 40000, '药品': 3000, '食物': 18000, '人流量': rdm(1000, 5000), '高度': 75, '危险系数': 0.1},
    '小寨村小区': {'口罩': 30000, '药品': 1000, '食物': 12000, '人流量': rdm(1000, 5000), '高度': 75, '危险系数': 0.1},
    '太白小区': {'口罩': 30000, '药品': 1000, '食物': 12000, '人流量': rdm(10000, 20000), '高度': 75, '危险系数': 0.1},
    '盛大时代广场': {'口罩': 2000, '药品': 100, '食物': 1000, '人流量': rdm(20000, 30000), '高度': 20, '危险系数': 0.1},
    '赛格购物中心': {'口罩': 2000, '药品': 100, '食物': 1000, '人流量': rdm(20000, 30000), '高度': 20, '危险系数': 0.1},
    '软件新城云汇谷': {'口罩': 5000, '药品': 100, '食物': 500, '人流量': rdm(1000, 5000), '高度': rdm(200, 350), '危险系数': 0.2},
    '隋大兴唐长安城明德门遗址公园': {'口罩': 4000, '药品': 500, '食物': 1200, '人流量': rdm(500, 1000), '高度': 50, '危险系数': 0.05},
    '木塔寺生态遗址公园': {'口罩': 4000, '药品': 600, '食物': 1500, '人流量': rdm(500, 1000), '高度': 10, '危险系数': 0.05},
    '杜邑遗址公园': {'口罩': 1000, '药品': 200, '食物': 1800, '人流量': rdm(500, 1000), '高度': 10, '危险系数': 0.05},
    '西安植物园': {'口罩': 1000, '药品': 200, '食物': 1800, '人流量': rdm(500, 1000), '高度': 10, '危险系数': 0.05},
    '西安人才公园': {'口罩': 1000, '药品': 200, '食物': 1800, '人流量': rdm(500, 1000), '高度': 10, '危险系数': 0.05},
    '雁南公园': {'口罩': 1000, '药品': 200, '食物': 1800, '人流量': rdm(500, 1000), '高度': 10, '危险系数': 0.05},
    '大雁塔': {'口罩': -100, '药品': -50, '食物': -20, '人流量': rdm(40000, 50000), '高度': 65, '危险系数': 0.2},
    '陕西历史博物馆': {'口罩': -100, '药品': -50, '食物': -20, '人流量': rdm(40000, 50000), '高度': 65, '危险系数': 0.2},
    '大唐芙蓉园': {'口罩': -100, '药品': -50, '食物': -20, '人流量': rdm(40000, 50000), '高度': 65, '危险系数': 0.2}
}


current_directory = os.path.dirname(os.path.abspath(__file__))
csv_file_path = os.path.join(current_directory, 'data.csv')


# csv_file_path = 'data.csv'
def create_data_csv():
    # 写入CSV文件
    with open(csv_file_path, mode='w', newline='') as csv_file:
        fieldnames = ['位置', '口罩', '药品', '食物', '人流量', '高度', '危险系数']
        writer = csv.DictWriter(csv_file, fieldnames=fieldnames)
        writer.writeheader()  # 写入表头

        for position, data in pos_dict.items():
            row = {'位置': position, '口罩': data['口罩'], '药品': data['药品'], '食物': data['食物'],
                   '人流量': data['人流量'], '高度': data['高度'], '危险系数': data['危险系数']}
            writer.writerow(row)
    return


def add_data_csv(location, mask, medicine, food, flood, height, danger):
    with open(csv_file_path, mode='a') as csv_file:
        fieldnames = ['位置', '口罩', '药品', '食物', '人流量', '高度', '危险系数']
        writer = csv.DictWriter(csv_file, fieldnames=fieldnames)
        row = {'位置': location, '口罩': mask, '药品': medicine, '食物': food,
               '人流量': flood, '高度': height, '危险系数': danger}
        writer.writerow(row)
    return


# create_poscsv('data.csv')
